; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-90)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b20)
    (on b20 b16)
    (on b16 b9)
    (on b9 b5)
    (on b5 b10)
    (on b10 b19)
    (on b19 b15)
    (on b15 b2)
    (on b2 b24)
    (on b24 b22)
    (on b22 b3)
    (on b3 b1)
    (on b1 b21)
    (on b21 b23)
    (on b23 b27)
    (on b27 b12)
    (on b12 b11)
    (on b11 b17)
    (on-table b17)
    (clear b4)
    (on-table b4)
    (clear b14)
    (on b14 b18)
    (on b18 b25)
    (on b25 b13)
    (on b13 b7)
    (on b7 b26)
    (on b26 b6)
    (on b6 b8)
    (on-table b8))
 (:goal (and 
(on b12 b5)
))
)

; plan
1. (unstack b20 b16)
   deleted: (on b20 b16) (clear b20) (arm-empty)
   added: (holding b20) (clear b16)
   goals met: 0 of 1
2. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 1
3. (unstack b16 b9)
   deleted: (on b16 b9) (clear b16) (arm-empty)
   added: (holding b16) (clear b9)
   goals met: 0 of 1
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
5. (unstack b9 b5)
   deleted: (on b9 b5) (clear b9) (arm-empty)
   added: (holding b9) (clear b5)
   goals met: 0 of 1
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
7. (unstack b5 b10)
   deleted: (on b5 b10) (clear b5) (arm-empty)
   added: (holding b5) (clear b10)
   goals met: 0 of 1
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
9. (unstack b10 b19)
   deleted: (on b10 b19) (clear b10) (arm-empty)
   added: (holding b10) (clear b19)
   goals met: 0 of 1
10. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
11. (unstack b19 b15)
   deleted: (on b19 b15) (clear b19) (arm-empty)
   added: (holding b19) (clear b15)
   goals met: 0 of 1
12. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
13. (unstack b15 b2)
   deleted: (on b15 b2) (clear b15) (arm-empty)
   added: (holding b15) (clear b2)
   goals met: 0 of 1
14. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
15. (unstack b2 b24)
   deleted: (on b2 b24) (clear b2) (arm-empty)
   added: (holding b2) (clear b24)
   goals met: 0 of 1
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
17. (unstack b24 b22)
   deleted: (on b24 b22) (clear b24) (arm-empty)
   added: (holding b24) (clear b22)
   goals met: 0 of 1
18. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
19. (unstack b22 b3)
   deleted: (on b22 b3) (clear b22) (arm-empty)
   added: (holding b22) (clear b3)
   goals met: 0 of 1
20. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
21. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 0 of 1
22. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
23. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 0 of 1
24. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
25. (unstack b21 b23)
   deleted: (on b21 b23) (clear b21) (arm-empty)
   added: (holding b21) (clear b23)
   goals met: 0 of 1
26. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
27. (unstack b23 b27)
   deleted: (on b23 b27) (clear b23) (arm-empty)
   added: (holding b23) (clear b27)
   goals met: 0 of 1
28. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
29. (unstack b27 b12)
   deleted: (on b27 b12) (clear b27) (arm-empty)
   added: (holding b27) (clear b12)
   goals met: 0 of 1
30. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 1
31. (unstack b12 b11)
   deleted: (on b12 b11) (clear b12) (arm-empty)
   added: (holding b12) (clear b11)
   goals met: 0 of 1
32. (stack b12 b5)
   deleted: (clear b5) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b5)
   goals met: 1 of 1
